
## Plan Result (aws/eks)

[CI link](https://github.com/44smkn/terraform/actions/runs/1976228754)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_ecr_repository.karpenter_controller
* Delete
  * aws_ecr_repository.karpenter


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.karpenter will be destroyed
  # (because aws_ecr_repository.karpenter is not in configuration)
  - resource "aws_ecr_repository" "karpenter" {
      - arn                  = "arn:aws:ecr:ap-northeast-1:171457761414:repository/karpenter" -> null
      - id                   = "karpenter" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "karpenter" -> null
      - registry_id          = "171457761414" -> null
      - repository_url       = "171457761414.dkr.ecr.ap-northeast-1.amazonaws.com/karpenter" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # aws_ecr_repository.karpenter_controller will be created
  + resource "aws_ecr_repository" "karpenter_controller" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "karpenter/controller"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecr_repository.karpenter has changed
  ~ resource "aws_ecr_repository" "karpenter" {
        id                   = "karpenter"
        name                 = "karpenter"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":44,"Program":"tfcmt","SHA1":"e3b85cdf065e29f8cc987ec2e1402bbe138818fc","Target":"aws/eks","Vars":{},"WorkflowName":"test"} -->